---
title: "Remove special characters from many file names recursively"
date: 2010-01-18
forum: General Help
---

### Post by moodog on 2010-01-18
I use Linux, and use a back up hard disk to store many, many files in a deep directory structure. Some of these files have characters in them that are legal in Linux, but Windows does not like them. When I share the HD with a friend who only uses Windows, unfortunately he is unable to read a lot of the files. 

Short of convincing him to move to Linux, is there an easy way to rename all of the problematic files to remove the special (illegal in Windows) characters?

---

### Post by KeLa on 2010-01-18
You can try something like this:
```
find ~/test/ -type f -name "*.*" -exec rename -v 's/채철책횆횜횇/aoaAOA/' {} \;
```
it will search from test directory recursively all files and rename those so that 채철책 etc are substituted with aoa etc.

---

### Post by moodog on 2010-01-19
Any other suggestions? This only works for one special character at a time, for some reason not all - i.e. :

```
> touch aei철책횆횜횇.txt

> find . -type f -name "*.*" -exec rename -v 's/채철책횆횜횇/aoaAOA/' {} \;
```

no output
even for:

```
> rename -v 's/채철책횆횜횇/aoaAOA/' aei철책횆횜횇.txt
```

however :

```
>  rename -v 's/철/o/' aei철책횆횜횇.txt 
aei철책횆횜횇.txt renamed as aeio책횆횜횇.txt

```

---

### Post by KeLa on 2010-01-19
Ok.

Try to add those charactes to brackets like this

```
s/[철채책횜횆횇]/[oaoOAO]/
```

---

### Post by john newbuntu on 2010-01-19
Why re-invent the wheel when devarthur has it:
[http://devarthur.blogspot.com/2008/08/copying-files-from-linux-to-windows.html](http://devarthur.blogspot.com/2008/08/copying-files-from-linux-to-windows.html)

---

### Post by alwayshere on 2010-01-19
krename is the best and most easy to use i have founduse below command in terminal to install it. 

sudo apt-get install krename

and to launch it. 

krename

Or theres a launcher under applications / accessories

---

### Post by jamesisin on 2010-01-19
Setting all name changing aside for the moment, if you run a Samba share your friends will be able to access the files but the file names will be altered using some (fantastically retarded) Windows convention.

---

### Post by ztyx on 2012-10-05
> **KeLa said:**
> Ok.

Try to add those charactes to brackets like this

```
s/[철채책횜횆횇]/[oaoOAO]/
```

This is wrong. You are not fully understanding Perl-style regexp substitutions correctly. Unfortunately, you can't get away with a single rename. Instead you will need to do multiple ones:

```

$ find . -type f -exec rename 's/[책채]/a/g' {} +
$ find . -type f -exec rename 's/[철]/o/g' {} +
$ find . -type f -exec rename 's/[횇횆]/A/g' {} +
$ find . -type f -exec rename 's/[횜]/O/g' {} +

```

They could be combined using

```

$ find . -type f -exec rename 's/[책채]/a/g' {} + -exec rename 's/[철]/o/g' {} + -exec rename 's/[횇횆]/A/g' {} + -exec rename 's/[횜]/O/g' {} +

```

If you simply would like to remove all non-alphanumeric characters you could do something like:

```

$ find . -type f -exec rename 's/[^A-Za-z0-9._]//g' {} +

```

---

